  Problem Statement 1:
 A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

In [3]:
df=pd.read_csv("Cutlets.csv")

In [4]:
df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [10]:
unitA=df['Unit A']

In [9]:
unitB=df['Unit B']

In [11]:
t=stats.ttest_ind(unitA,unitB)
p=t[1]

In [12]:
p

0.4722394724599501

In [13]:
if p>0.05:
    print('Accept Null hypothesis, P value:',p)
else:
        print('Go for Alternate hypothesis, p value',p)

Accept Null hypothesis, P value: 0.4722394724599501

Problem Statement 2: A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.

Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [14]:
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

In [15]:
lab=pd.read_csv("LabTAT.csv")

In [16]:
lab

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [20]:
lab.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [18]:
w,pvalue = stats.f_oneway(lab.iloc[:,0], lab.iloc[:,1],lab.iloc[:,2],lab.iloc[:,3])

In [21]:
w,pvalue

(118.70421654401437, 2.1156708949992414e-57)

In [22]:
if pvalue>0.05:
    print ('Accept null hypothesis, P value:',pvalue)
else:
        print('Go for alternate hypothesis, P value',pvalue)

Go for alternate hypothesis, P value 2.1156708949992414e-57

Problem Statement 3: Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

In [25]:
buyersratio=pd.read_csv("BuyerRatio.csv")

In [26]:
buyersratio

  Observed Values  Males  Females
0            East     50      435
1            West    142     1523
2          North     131     1356
3           South     70      750

In [27]:
male=buyersratio['Males']
female=buyersratio['Females']

In [28]:
t = stats.ttest_ind(male,female)
p_2=t[1]
if p_2>0.05:
    print('Accept null hypothesis,p value', p_2)
else:
        print('Pick alternate hypothesis,p value', p_2)

Pick alternate hypothesis,p value 0.011594334372357056

problem statement 4: TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain % of the customer order forms. Any error in order form renders it defective and has to be reworked before processing. The manager wants to check whether the defective % varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [29]:
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

In [30]:
customer=pd.read_csv("Customer+OrderForm.csv")

In [31]:
customer

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [34]:
customer.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [32]:
from scipy.stats import chi2_contingency
from scipy.stats import chi2

In [35]:
# Phillippines
x1 = 0
y1 = 0
for i in customer['Phillippines']:
    if i == 'Error Free':
        x1=x1+1
    else:
        y1=y1+1
# Indonesia
x2=0
y2=0
for i in customer['Indonesia']:
    if i == 'Error Free':
        x2=x2+1
    else:
        y2=y2+1
# Malta
x3=0
y3=0
for i in customer['Malta']:
    if i == 'Error Free':
        x3=x3+1
    else:
        y3=y3+1
# India
x4=0
y4=0
for i in customer['India']:
    if i == 'Error Free':
        x4=x4+1
    else:
        y4=y4+1

In [39]:
data={'Error Free': [x1,x2,x3,x4],
     'Defective': [y1,y2,y3,y4]}

df=pd.DataFrame(data, columns = ['Error Free','Defective'], index=['Phillippines','Indonesia','Malta','India'])

In [42]:
stat, p, dof, expected1 = chi2_contingency(df)
print(p)

0.2771020991233144